blogs/modify-querystring-use-nginx.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-11-03 四 10:32 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>nginx 做代理时如何修改querystring</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="root" />
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">nginx 做代理时如何修改querystring</h1>
<p>
我们有段nginx配置是这样的：
</p>
<div class="org-src-container">

<pre class="src src-c">set $arg_from <span style="color: #00ff00;">"1"</span>;
<span style="color: #00ffff; font-weight: bold;">if</span> ($host = <span style="color: #00ff00;">"inner.domain"</span>) {
  set $arg_from <span style="color: #00ff00;">"0"</span>;
}
set $args <span style="color: #00ff00;">"$args&amp;from=$arg_from"</span>;
</pre>
</div>

<p>
如果请求来自inner.domain域名，就给querystring添加参数from=0，表明是内网过来的（公网入口不会转发host为inner.domain的请求）。这样upstream只需要检查from参数即可判断请求来源，和域名解绑了。
</p>

<p>
但是这个配置有个bug，如果用户请求时添加 <code>from=0</code> 参数，从公网发请求，querystring变成了 <code>from=0&amp;from=1</code> ，上面的配置是追加参数，而不是修改参数。那么该如何修复这个bug呢？核心是修改 <code>$args</code> ，很多方法也是围绕这个展开的，但是都不够通用。
</p>

<p>
最后我也没找到修改 <code>$args</code> 的好办法，但是问题解决了，最后的配置是这样的：
</p>
<div class="org-src-container">

<pre class="src src-c"><span style="color: #00ffff; font-weight: bold;">if</span> ($arg_from != <span style="color: #00ff00;">""</span>) {
  <span style="color: #00ffff; font-weight: bold;">return</span> 401;
}
set $arg_from <span style="color: #00ff00;">"1"</span>;
<span style="color: #00ffff; font-weight: bold;">if</span> ($host = <span style="color: #00ff00;">"inner.domain"</span>) {
  set $arg_from <span style="color: #00ff00;">"0"</span>;
}
set $args <span style="color: #00ff00;">"$args&amp;from=$arg_from"</span>;
</pre>
</div>
<p>
既然不能修改 <code>$args</code>, 那就禁止用户传 <code>from</code> 参数，曲线救国达到目的。
</p>

<p>
说到底，依赖 <code>querystring</code> 里的参数不是个好主意，最好的方法是使用Header，更加通用。不会有两个同名Header，也不用担心和请求里可能会有的from参数冲突。
</p>
<div class="org-src-container">

<pre class="src src-c">set $req_source 1;
<span style="color: #00ffff; font-weight: bold;">if</span> ($host = <span style="color: #00ff00;">"inner.domain"</span>) {
  set $req_source 0;
}
<span style="color: #00ff00;">proxy_set_header</span> <span style="color: #ffff00;">X</span>-Req-Source $req_source;
</pre>
</div>

<p>
这应该算不上是一种技巧，但是它提醒我，专注于目的，而不是解决问题的手段。
</p>
</div>
<div id="postamble" class="status">
<p class="author">Author: root</p>
<p class="date">Created: 2016-11-03 四 10:32</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
